In [1]:
import pandas as pd
import numpy as np

In [7]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4)) # 0~9까지의 수 중 4개의 수를 추출하여 0~3까지의 인덱스에 부여
ser

0    6
1    3
2    7
3    4
dtype: int32

In [8]:
# 0~9까지의 수를 3행 4열에 부여하고 컬럼명을 'A','B','C','D'로 부여한다. 
df = pd.DataFrame(rng.randint(0, 10, (3, 4)),columns=['A', 'B', 'C', 'D']) 
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [9]:
np.exp(ser) # 각 성분을 무리수 e의 지수로 삼은 값을 계산하기(자연수 e의 값은 대충 2.71828182845904523536 )

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [11]:
np.sin(df * np.pi / 4)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

In [12]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,'New York': 19651127}, name='population')

In [13]:
population / area # 두 입력 배열의 인덱스의 합집합을 담고 있으며 합집합은 이 인덱스에 표준 파이썬 집합 연산을 사용해 결정
                 # 하나라도 같이 없는 항목은 Pandas가 누락된 데이터를 표시하는 방식에 따라 NaN

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [14]:
area.index | population.index   # area와 population의 모든 index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [15]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [16]:
A.add(B, fill_value=0) # NaN값 사용을 원치 않을 경우, 연산자 대신에 적절한 객체 메서드를 사용해 채우기

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [17]:
# 연산을 수행할 때 열과 인덱스 모두에서 비슷한 유형의 정렬이 발생한다
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),columns=list('AB'))
A

   A   B
0  1  11
1  5   1

In [18]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)), columns=list('BAC'))
B

   B  A  C
0  4  0  9
1  5  8  0
2  9  2  6

In [19]:
A + B

      A     B   C
0   1.0  15.0 NaN
1  13.0   6.0 NaN
2   NaN   NaN NaN

In [20]:
fill = A.stack().mean() # 누락된 값 대신 원하는 fill_value를 전달할 수 있데 여기서는 A에 있는 모든 값의 평균값으로 채운다
A.add(B, fill_value=fill)

      A     B     C
0   1.0  15.0  13.5
1  13.0   6.0   4.5
2   6.5  13.5  10.5

In [21]:
# Ufuncs: DataFrame과 Series간의 연산
# 2차원 NumPy배열과 1차원 NumPy배열 사이의 연산과 비슷하다
A = rng.randint(10, size=(3, 4))
A

array([[3, 8, 2, 4],
       [2, 6, 4, 8],
       [6, 1, 3, 8]])

In [22]:
A - A[0]

array([[ 0,  0,  0,  0],
       [-1, -2,  2,  4],
       [ 3, -7,  1,  4]])

In [26]:
df = pd.DataFrame(A, columns=list('QRST'))
df

   Q  R  S  T
0  3  8  2  4
1  2  6  4  8
2  6  1  3  8

In [27]:
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1 -1 -2  2  4
2  3 -7  1  4

In [34]:
# ① aixs=0(index)은 행을 따라 동작합니다. 각 컬럼의 모든 행에 대해서 작용합니다. ② aixs=1(columns)은 열을 따라 동작합니다. 각 행의 모든 컬럼에 대해서 작동합니다.
df.subtract(df['R'], axis=0) # 열 방향으로 연산하고자 한다면 앞에서 언급한 객체 메서드를 사용하면서 axis키워드를 지정하면 된다.

   Q  R  S  T
0 -5  0 -6 -4
1 -4  0 -2  2
2  5  0  2  7

In [43]:
halfrow = df.iloc[0, ::2]
halfrow

Q    3
S    2
Name: 0, dtype: int32

In [45]:
df - halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1 -1.0 NaN  2.0 NaN
2  3.0 NaN  1.0 NaN

In [ ]:
https://hogni.tistory.com/49